tap "axllent/apps"
tap "homebrew/bundle"
tap "homebrew/services"
tap "stripe/stripe-cli"

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew "tesseract-lang"
brew "tesseract"
brew "ocrmypdf"

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'deno'
brew 'pandoc'


# Apps
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'herd'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'signal'
cask 'element'
cask 'iterm2'
cask 'ghostty'
cask 'spotify'
cask 'keepassxc'
cask 'bruno'
cask 'proton-drive'
cask 'obsidian'
cask 'vlc'
cask 'dbngin'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'


# Mac App Store
mas 'Magnet', id: 441258766
mas 'Toggle Track: Hours & Time Log', id: 1291898086


